[
    {
      "name": "Spaghetti",
      "ingredients": "2 lbs Italian sausage, casings removed (mild or hot)\n1 small onion, chopped (optional)\n3 -4 garlic cloves, minced\n1 (28 ounce) can diced tomatoes\n2 (6 ounce) cans tomato paste\n2 (15 ounce) cans tomato sauce\n2 cups water (for a long period of simmering for flavors to meld. If you don't want to simmer it as long, add less)\n3 teaspoons basil\n2 teaspoons dried parsley flakes\n1 1⁄2 teaspoons brown sugar\n1 teaspoon salt\n1⁄4 - 1⁄2 teaspoon crushed red pepper flakes\n1⁄4 teaspoon fresh coarse ground black pepper\n1⁄4 cup red wine (a good Cabernet!)\n1 lb thin spaghetti\nparmesan cheese",
      "directions": "In large, heavy stockpot, brown Italian sausage, breaking up as you stir.\nAdd onions and continue to cook, stirring occasionally until onions are softened.\nAdd garlic, tomatoes, tomato paste, tomato sauce and water.\nAdd basil, parsley, brown sugar, salt, crushed red pepper, and black pepper.\nStir well and barely bring to a boil.\nStir in red wine.\nSimmer on low, stirring frequently for at least an hour. A longer simmer makes for a better sauce, just be careful not to let it burn!\nCook spaghetti according to package directions.\nSpoon sauce over drained spaghetti noodles and sprinkle with parmesan cheese.",
      "description": "",
      "image": "./images/spaghetti.png"
    },
    {
      "name": "Strawberry Waffles",
      "ingredients": "Strawberry Waffles\n24 ripe strawberries\n2 heaping Tbsp pure cane sugar, plus 1 Tbsp\n1 3⁄4 cups flour\n2 tsp baking powder\n¼ tsp baking soda\n¼ tsp salt\n3 large eggs\n1 ¼ cups plus 2 Tbsp buttermilk\n1 stick unsalted butter, melted and cooled slightly, plus 4 Tbsp, melted, for the waffle iron\n2 tsp raspberry liqueur, optional\nStrawberry-Black Pepper Butter\n12 strawberries, finely diced\n2 sticks unsalted butter, at room temperature\n2 Tbsp honey\nPinch salt\nPinch coarsely ground black pepper\nLemon Curd Whipped Cream\n1 cup very cold heavy cream\nFinely grated zest of 1 lemon\n¼ cup prepared lemon curd",
      "directions": "For the strawberry waffles: Finely dice eight of the strawberries, and combine in a small bowl with 1 heaping tablespoon sugar and the raspberry liqueur if using. Let sit at room temperature until the strawberries soften slightly and release some juice, about 15 minutes. Thinly slice the remaining strawberries lengthwise, and toss with the remaining 1 heaping tablespoon sugar.\nWhisk together the flour, baking powder, baking soda, salt and 1 tablespoon of sugar in a large bowl. In a small bowl, whisk together the eggs and buttermilk. Add the wet ingredients to the dry ingredients, and whisk until the mixture just comes together. Fold in the diced strawberries and their juices, and the melted butter until just combined. Cover, and let sit at room temperature for 30 minutes.\nFor the strawberry-black pepper butter: combine the strawberries, butter, honey, salt and pepper in a food processor. Process until almost smooth. Scrape into a bowl, and set aside at room temperature.\nFor the lemon curd whipped cream: combine the heavy cream and lemon zest in the bowl of a stand mixer fitted with the whip attachment. Whip until slightly thickened. Add the lemon curd, and continue whipping until soft peaks form. Chill until ready to serve.\nHeat a waffle iron according to the manufacturer’s directions. Brush with melted butter, and ladle batter onto the iron. Close the cover, and cook until crisp, about 4 minutes. Serve immediately, or transfer the waffle to a rack set over a baking sheet and keep warm in a 200 degree oven. Repeat with the remaining batter and melted butter.\nTop the waffles with strawberry butter, sliced strawberries and a dollop of the whipped cream",
      "description": "Strawberry waffles with strawberry-black pepper butter and a lemon curd cream make the perfect sweet and citrusy treat for any brunch.",
      "image": "./images/strawberry-waffles.png"
    }
  ]